---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveTop
source: html/dfda5ba2-0c09-d42d-e301-12352c4e79bd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveTop Property

"Top Clip Active"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerBoundActiveTop { get; }
```